---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BentFabricSheetTooShortSegments
source: html/ed2892bb-4e21-eec2-9052-820e98f32d29.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BentFabricSheetTooShortSegments Property

A segment in the bend profile is too short to apply the wire bend diameter. The bent fabric sheet of the selected type cannot be placed in a host. Click Continue to correct the profile or Click Quit sketching to exit the bend profile editor.

## Syntax (C#)
```csharp
public static FailureDefinitionId BentFabricSheetTooShortSegments { get; }
```